Repository: vil4max/groundhog-day-ios
Catalog: ios/GroundhogDay/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uk

# common.cancel
source: Cancel
ru: Отмена
uk: Скасувати

# common.save
source: Save
ru: Сохранить
uk: Зберегти

# countdown.eventNamed %@ %@ %@
source: Phil's still waking at 6:00. “%1$@” ends %2$@ at %3$@
ru: У Фила снова 6:00. «%1$@» — выход %2$@ в %3$@
uk: У Філа знову 6:00. «%1$@» — вихід %2$@ о %3$@

# countdown.eventPlain %@ %@
source: Somewhere it's always 6:00. Your loop breaks %1$@ at %2$@
ru: Где-то снова 6:00. Ваша петля рвётся %1$@ в %2$@
uk: Десь знову 6:00. Ваша петля рветься %1$@ о %2$@

# countdown.loopBreaksLabel
source: Loop breaks
ru: Петля рвётся
uk: Петля рветься

# countdown.openSettings
source: Opens settings
ru: Открыть настройки
uk: Відкрити налаштування

# countdown.quote.1
source: Well, what if there is no tomorrow? There wasn't one today.
ru: А что, если завтра не наступит? Сегодня ведь его не было.
uk: А що, якщо завтра не настане? Сьогодні ж його не було.

# countdown.quote.2
source: This is one time where television really fails to capture the true excitement of a large squirrel predicting the weather.
ru: Это тот случай, когда телевидение не способно передать весь восторг от сурка, предсказывающего погоду.
uk: Це той випадок, коли телебачення не здатне передати весь захват від бабака, що передбачає погоду.

# countdown.quote.3
source: I'm a god. I'm not the God… I don't think.
ru: Я бог. Не Бог… наверное.
uk: Я бог. Не Бог… напевно.

# countdown.quote.4
source: Don't drive angry!
ru: Не злись за рулём!
uk: Не злися за кермом!

# countdown.quote.6
source: It's gonna be cold, it's gonna be gray, and it's gonna last you for the rest of your life.
ru: Будет холодно, будет серо, и это продлится всю твою жизнь.
uk: Буде холодно, буде сіро, і це триватиме все твоє життя.

# countdown.quote.7
source: I have been stabbed, shot, poisoned, frozen, hung, electrocuted, and burned.
ru: Меня резали, стреляли в меня, травили, замораживали, вешали, били током и сжигали.
uk: Мене різали, стріляли в мене, отруювали, заморожували, вішали, били струмом і спалювали.

# countdown.quote.8
source: People like blood sausage, too. People are morons.
ru: Людям нравится и кровяная колбаса. Люди идиоты.
uk: Людям подобається й кров'яна ковбаса. Люди ідіоти.

# countdown.swipeHint
source: Swipe — months, weeks, days…
ru: Свайп — месяцы, недели, дни…
uk: Свайп — місяці, тижні, дні…

# countdown.title
source: Not yet
ru: Пока рано
uk: Ще рано

# countdown.title.passed
source: Same day again?
ru: Снова этот день?
uk: Знову цей день?

# countdown.title.soon
source: Almost 6:00
ru: Почти шесть
uk: Майже шоста

# countdown.until %@
source: until %@
ru: до %@
uk: до %@

# event.alreadyHappened
source: It's over. The countdown has stopped.
ru: Уже наступило. Отсчёт остановлен.
uk: Вже наступило. Відлік зупинено.

# onboarding.dateInPast
source: That day is already behind us. Pick one ahead.
ru: Этот день уже был. Выберите тот, что впереди.
uk: Цей день уже був. Оберіть той, що попереду.

# onboarding.dateRangeHint
source: Up to 99 years ahead — years always fit on the clock.
ru: До 99 лет вперёд — годы всегда помещаются на циферблате.
uk: До 99 років уперед — роки завжди вміщуються на циферблаті.

# onboarding.dateTooFar
source: Pick a date within the next 99 years.
ru: Выберите дату в пределах 99 лет.
uk: Оберіть дату в межах 99 років.

# onboarding.eventLabel
source: What's the occasion? (optional)
ru: Повод для ожидания (необязательно)
uk: Привід для очікування (необов'язково)

# onboarding.eventLabelPlaceholder
source: Groundhog Day
ru: День сурка
uk: День бабака

# onboarding.headline
source: Let's pick your day
ru: Выберем ваш день
uk: Оберіримо ваш день

# onboarding.pickDate
source: Event date
ru: Дата события
uk: Дата події

# onboarding.settingsHint
source: Changed your mind? Settings is right there.
ru: Передумали — Настройки никуда не денутся.
uk: Передумали — Налаштування нікуди не дінуться.

# onboarding.start
source: Start waiting
ru: Начать ждать
uk: Почати чекати

# onboarding.subtitle
source: Pick the date you're waiting for. Time defaults to 6:00 — like the hotel alarm in Groundhog Day. Not a morning person? Change it in Settings.
ru: Выберите дату, которую ждёте. По умолчанию время — 6:00, как будильник в «Дне сурка». Не хотите вставать в шесть — измените в Настройках.
uk: Оберіть дату, яку чекаєте. За замовчуванням час — 6:00, як будильник у «Дні бабака». Не хочете вставати о шостій — змініть у Налаштуваннях.

# onboarding.title
source: Countdown
ru: Отсчёт
uk: Відлік

# permission.benefit.arrival
source: A ping when your date finally arrives
ru: Сигнал, когда дата наконец наступит
uk: Сигнал, коли дата нарешті настане

# permission.benefit.morning
source: A gentle nudge every morning at 6:00
ru: Лёгкий толчок каждое утро в 6:00
uk: Легкий поштовх щоранку о 6:00

# permission.benefit.settings
source: Turn off anytime in Settings
ru: Отключить в любой момент в Настройках
uk: Вимкнути будь-коли в Налаштуваннях

# permission.enable
source: Enable reminders
ru: Включить напоминания
uk: Увімкнути нагадування

# permission.notifications.body
source: So the big day doesn't sneak up on you.
ru: Чтобы главный день не подкрался незаметно.
uk: Щоб головний день не підкрався непомітно.

# permission.notifications.title
source: Don't miss the big day
ru: Не проспите главный день
uk: Не проспіть головний день

# permission.notNow
source: Maybe tomorrow
ru: Может, завтра
uk: Може, завтра

# push.daily.body
source: Another day passed. You're one day closer.
ru: Ещё один день прошёл. Вы на день ближе к дате.
uk: Ще один день минув. Ви на день ближче до дати.

# push.daily.body.labeled %@
source: Until %@
ru: До %@
uk: До %@

# push.daily.body.labeled.withAlarm %@ %@
source: %@ Until %@
ru: %@ До %@
uk: %@ До %@

# push.daily.body.withAlarm %@
source: %@ Another day passed. You're one day closer.
ru: %@ Ещё один день прошёл. Вы на день ближе к дате.
uk: %@ Ще один день минув. Ви на день ближче до дати.

# push.daily.title %lld
source: %lld days
ru: %lld дней
uk: %lld днів

# push.alarm.1
source: Okay, campers, rise and shine, and don't forget your booties 'cause it's cooooold out there today.
ru: Ну что, ребята, подъём! И не забудьте тапочки — на улице сегодня оооочень холодно.
uk: Ну що, друзі, підйом! І не забудьте тапочки — на вулиці сьогодні дуууже холодно.

# push.alarm.2
source: It's coooold out there today.
ru: На улице сегодня оооочень холодно.
uk: На вулиці сьогодні дуууже холодно.

# push.alarm.3
source: Don't forget your booties 'cause it's coooold out there today.
ru: Не забудьте тапочки — на улице сегодня оооочень холодно.
uk: Не забудьте тапочки — на вулиці сьогодні дуууже холодно.

# push.alarm.4
source: Put a little shuffle in your step.
ru: Добавьте чуть-чуть пружинки в походку.
uk: Додайте трохи пружинки в ходу.

# push.alarm.5
source: It's Groundhog Day! At the crack of dawn, everyone's going to be lining up at Gobbler's Knob.
ru: Сегодня День сурка! На рассвете все выстроятся в очередь на Курином холме.
uk: Сьогодні День бабака! На світанку усі вишикуються в чергу на Курячому пагорбі.

# push.alarm.6
source: Each and every one of you assembled here today is getting older.
ru: Каждый из вас, собравшихся здесь сегодня, становится старше.
uk: Кожен із вас, зібраних тут сьогодні, стає старшим.

# push.alarm.7
source: Well, it's Groundhog Day. Again.
ru: Ну что ж, сегодня День сурка. Снова.
uk: Ну що ж, сьогодні День бабака. Знову.

# push.eventArrived.body %@
source: Your day has come: %@
ru: Наступил день: %@
uk: Настав день: %@

# push.eventArrived.bodyGeneric
source: The day you waited for is here. You made it.
ru: Тот самый день наступил. Можно выдохнуть.
uk: Той самий день настав. Можна видихнути.

# push.eventArrived.title
source: It's Groundhog Day!
ru: День сурка!
uk: День бабака!

# settings.dailyReminderMessage
source: Morning message
ru: Утреннее сообщение
uk: Ранкове повідомлення

# settings.defaultUnit
source: Default unit
ru: Единица по умолчанию
uk: Одиниця за замовчуванням

# settings.displaySection
source: Countdown
ru: Отсчёт
uk: Відлік

# settings.eventArrivedMessage
source: Day-of message
ru: Сообщение в день события
uk: Повідомлення в день події

# settings.eventDate
source: Event date
ru: Дата события
uk: Дата події

# settings.eventSection
source: Event
ru: Событие
uk: Подія

# settings.notifications
source: Daily reminders
ru: Ежедневные напоминания
uk: Щоденні нагадування

# settings.notifications.footer
source: Daily at 6:00 — like the radio alarm. Leave a field empty for the movie default, or write your own. Turn off here or in system Settings.
ru: Каждый день в 6:00 — как радио-будильник. Пустое поле — фраза из фильма, можно написать своё. Отключить здесь или в настройках системы.
uk: Щодня о 6:00 — як радіо-будильник. Порожнє поле — фраза з фільму, можна написати своє. Вимкнути тут або в системних налаштуваннях.

# settings.openSystemSettings
source: Open system Settings
ru: Открыть настройки системы
uk: Відкрити системні налаштування

# settings.title
source: Settings
ru: Настройки
uk: Налаштування

# unit.days
source: days
ru: дней
uk: днів

# unit.hours
source: hours
ru: часов
uk: годин

# unit.minutes
source: minutes
ru: минут
uk: хвилин

# unit.months
source: months
ru: месяцев
uk: місяців

# unit.seconds
source: seconds
ru: секунд
uk: секунд

# unit.weeks
source: weeks
ru: недель
uk: тижнів

# unit.years
source: years
ru: лет
uk: років
